; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (pred_1 ?v2)
               (pred_5 ?v2)
               (pred_3)
               (pred_4 ?v2)
               (pred_2 ?v2 ?v1))

  (:action op_4
    :parameters (?v3)
    :precondition (and (pred_1 ?v3) (pred_5 ?v3) (pred_3))
    :effect (and (pred_4 ?v3) (not (pred_1 ?v3)) (not (pred_5 ?v3)) 
                 (not (pred_3))))

  (:action op_1
    :parameters  (?v3)
    :precondition (pred_4 ?v3)
    :effect (and (pred_1 ?v3) (pred_3) (pred_5 ?v3) 
                 (not (pred_4 ?v3))))

  (:action op_2
    :parameters  (?v3 ?v4)
    :precondition (and (pred_1 ?v4) (pred_4 ?v3))
    :effect (and (pred_3) (pred_1 ?v3) (pred_2 ?v3 ?v4)
                 (not (pred_1 ?v4)) (not (pred_4 ?v3))))

  (:action op_3
    :parameters  (?v3 ?v4)
    :precondition (and (pred_2 ?v3 ?v4) (pred_1 ?v3) (pred_3))
    :effect (and (pred_4 ?v3) (pred_1 ?v4)
                 (not (pred_2 ?v3 ?v4)) (not (pred_1 ?v3)) (not (pred_3)))))

; problem
(define (problem BW-rand-6)
(:domain blocksworld)
(:objects obj_04 obj_05 obj_03 obj_06 obj_01 obj_02 )
(:init
(pred_3)
(pred_5 obj_04)
(pred_2 obj_05 obj_06)
(pred_5 obj_03)
(pred_2 obj_06 obj_01)
(pred_2 obj_01 obj_02)
(pred_5 obj_02)
(pred_1 obj_04)
(pred_1 obj_05)
(pred_1 obj_03)
)
(:goal
(and
(pred_2 obj_04 obj_02)
(pred_5 obj_05)
(pred_5 obj_03)
(pred_2 obj_06 obj_04)
(pred_2 obj_01 obj_06)
(pred_2 obj_02 obj_05))
)

(:constraints
  (sometime-before (pred_5 obj_05) (pred_2 obj_04 obj_02))
)
)

; plan
1. (op_3 obj_05 obj_06)
   deleted: (pred_2 obj_05 obj_06) (pred_1 obj_05) (pred_3)
   added: (pred_4 obj_05) (pred_1 obj_06)
   goals met: 1 of 6
2. (op_2 obj_05 obj_04)
   deleted: (pred_1 obj_04) (pred_4 obj_05)
   added: (pred_3) (pred_1 obj_05) (pred_2 obj_05 obj_04)
   goals met: 1 of 6
3. (op_3 obj_06 obj_01)
   deleted: (pred_2 obj_06 obj_01) (pred_1 obj_06) (pred_3)
   added: (pred_4 obj_06) (pred_1 obj_01)
   goals met: 1 of 6
4. (op_1 obj_06)
   deleted: (pred_4 obj_06)
   added: (pred_1 obj_06) (pred_3) (pred_5 obj_06)
   goals met: 1 of 6
5. (op_3 obj_01 obj_02)
   deleted: (pred_2 obj_01 obj_02) (pred_1 obj_01) (pred_3)
   added: (pred_4 obj_01) (pred_1 obj_02)
   goals met: 1 of 6
6. (op_2 obj_01 obj_06)
   deleted: (pred_1 obj_06) (pred_4 obj_01)
   added: (pred_3) (pred_1 obj_01) (pred_2 obj_01 obj_06)
   goals met: 2 of 6
7. (op_3 obj_05 obj_04)
   deleted: (pred_2 obj_05 obj_04) (pred_1 obj_05) (pred_3)
   added: (pred_4 obj_05) (pred_1 obj_04)
   goals met: 2 of 6
8. (op_2 obj_05 obj_03)
   deleted: (pred_1 obj_03) (pred_4 obj_05)
   added: (pred_3) (pred_1 obj_05) (pred_2 obj_05 obj_03)
   goals met: 2 of 6
9. (op_4 obj_04)
   deleted: (pred_1 obj_04) (pred_5 obj_04) (pred_3)
   added: (pred_4 obj_04)
   goals met: 2 of 6
10. (op_2 obj_04 obj_02)
   deleted: (pred_1 obj_02) (pred_4 obj_04)
   added: (pred_3) (pred_1 obj_04) (pred_2 obj_04 obj_02)
   goals met: 3 of 6
11. (op_3 obj_05 obj_03)
   deleted: (pred_2 obj_05 obj_03) (pred_1 obj_05) (pred_3)
   added: (pred_4 obj_05) (pred_1 obj_03)
   goals met: 3 of 6
12. (op_1 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_1 obj_05) (pred_3) (pred_5 obj_05)
   goals met: 4 of 6
13. (op_3 obj_04 obj_02)
   deleted: (pred_2 obj_04 obj_02) (pred_1 obj_04) (pred_3)
   added: (pred_4 obj_04) (pred_1 obj_02)
   goals met: 3 of 6
14. (op_1 obj_04)
   deleted: (pred_4 obj_04)
   added: (pred_1 obj_04) (pred_3) (pred_5 obj_04)
   goals met: 3 of 6
15. (op_4 obj_02)
   deleted: (pred_1 obj_02) (pred_5 obj_02) (pred_3)
   added: (pred_4 obj_02)
   goals met: 3 of 6
16. (op_2 obj_02 obj_05)
   deleted: (pred_1 obj_05) (pred_4 obj_02)
   added: (pred_3) (pred_1 obj_02) (pred_2 obj_02 obj_05)
   goals met: 4 of 6
17. (op_4 obj_04)
   deleted: (pred_1 obj_04) (pred_5 obj_04) (pred_3)
   added: (pred_4 obj_04)
   goals met: 4 of 6
18. (op_2 obj_04 obj_02)
   deleted: (pred_1 obj_02) (pred_4 obj_04)
   added: (pred_3) (pred_1 obj_04) (pred_2 obj_04 obj_02)
   goals met: 5 of 6
19. (op_3 obj_01 obj_06)
   deleted: (pred_2 obj_01 obj_06) (pred_1 obj_01) (pred_3)
   added: (pred_4 obj_01) (pred_1 obj_06)
   goals met: 4 of 6
20. (op_1 obj_01)
   deleted: (pred_4 obj_01)
   added: (pred_1 obj_01) (pred_3) (pred_5 obj_01)
   goals met: 4 of 6
21. (op_4 obj_06)
   deleted: (pred_1 obj_06) (pred_5 obj_06) (pred_3)
   added: (pred_4 obj_06)
   goals met: 4 of 6
22. (op_2 obj_06 obj_04)
   deleted: (pred_1 obj_04) (pred_4 obj_06)
   added: (pred_3) (pred_1 obj_06) (pred_2 obj_06 obj_04)
   goals met: 5 of 6
23. (op_4 obj_01)
   deleted: (pred_1 obj_01) (pred_5 obj_01) (pred_3)
   added: (pred_4 obj_01)
   goals met: 5 of 6
24. (op_2 obj_01 obj_06)
   deleted: (pred_1 obj_06) (pred_4 obj_01)
   added: (pred_3) (pred_1 obj_01) (pred_2 obj_01 obj_06)
   goals met: 6 of 6
